// 1)რა განსხვავებაა let, const შორის?
console.log("---------")
console.log("Task 1")
console.log("let-ში შეგვიძლია მნიშვნელობის შეცვლა, ხოლო const-ში არა. ანუ მაგალითად let a = 1; a = 2; ეს გამართლებულია და მუშაობს, მაგრამ const b = 1 b = 2 ზე გამოვა ერორ შეცდომა გამოვა კონსოლში.");
// let a = 1
// a = 2
// // const b = 1;
// // b = 2;
// console.log(a)
// // console.log(b); 


// 2)რა განსხვავებაა primitive და nonprimitive type-ებს შორის?
console.log("---------")
console.log("Task 2")
console.log("Primitive-ები არის string, number, boolean, null, undefined და symbol. nonprimitive-ები არის object, array და function. მათ შორის განსხვავება იმაში არის, რომ Primitive-ები ინახავს მნიშვნელობას, ხოლო nonprimitive-ები ინახავს ობიექტების მისამართს .")
// 3)რა განსხვავებაა == და === ოპერატორებს შორის?
console.log("---------")
console.log("Task 3")
console.log("2 ==-ის  ოპერატორი ადარებს მნიშვნელობას და 3 === ოპერატორი ადარებს მნიშვნელობას და ტიპს.")
console.log(2 == "2") // აბრუნებს true-ს
console.log(2 === "2") // აბრუნებს false-ს
// 4)რა ტიპის არის null
console.log("---------")
console.log("Task 4")
console.log("null არის იგივე ცარიელი მნიშვნელობა და არის primitive ტიპის")
// 5)რა განსხვავებაა funtion და = () => {} შორის
console.log("---------")
console.log("Task 5")
console.log("function არის ფუნქციის დეკლარაცია, ხოლო () => {} arrow. ანუ მათ შორის განსხვავება არის ის, რომ დეკლარაციაში აქვს this მეთოდი, ხოლო arrow ფუნქციას არა")
// 6)რას ნიშნავს callback function?
console.log("---------")
console.log("Task 6")
console.log("callback არის ფუნქცია რომელიც გადაცემს არგუმენტად და გამოიძახებს callback ფუნქციას კონკრეტულ დროს ან კონკრეტულ მოვლენაზე. მაგალითად setTimeout(() => { console.log('Hello'); }, 1000); აქ setTimeout არის callback ფუნქცია რომელიც გამოიძახებს arrow ფუნქციას  1 წამში(1000).")
// 7)რა განსხვავებაა map, filter და reduce-ს შორის?
console.log("---------")
console.log("Task 7")
console.log("map არის ფუნქცია რომელიც მასივიდან ირჩევს თითოეულ ელემენტს და ქმნის ახალ მასივს, filter არის  რომელიც ირჩევს მასივის თითოეულ ელემენტს ანუ გაფილტრავს და ქმნის ახალ მასივს რომლებიც აკმაყოფილებს პირობას და მოთხოვნას, reduce კი ირჩევს მასივის თითოეულ ელემენტს და ამუშავებს მათ ერთიან მნიშვნელობად, როგორიცაა ჯამის გამოთვლა და ა.შ");
// 8)რა არის Promise?
console.log("---------")
console.log("Task 8")
console.log("Promise არის ობიექტი რომელიც ასინქრონული ოპერაციების შედეგს წარმოადგენს. ანუ Promise-ში შეიძლება იყოს res და rej: resolved (წარმატებით შესრულებული) და rejected (შეცდომით შესრულებული) ");
// 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის?
console.log("---------")
console.log("Task 9")
console.log("Promise.all იღებს ყველა resolve და reject პრომისები დააბრუნოს, ნუ პირობის თანახმად.Promise.race იღებს ვინც მალე მოვა დროში იმას გამოიტანს. Promise.any კი იღებს ერთ წარმატებულ პრომის, თუ ყველა რეჯექტია მაშინ ის აბრუნებს AggregateError-ს")

// 10)რას ნიშნავს async/await და რატომ ვიყენებთ?
console.log("---------")
console.log("Task 10")
console.log("async/await არის სინტაქსი, რომელიც გამოიყენება ასინქრონულ კოდთან მუშაიბუთ და ასევე პრომისებთან. await არის ასინქრონული ოპერაციის შედეგის მიღების მეთოდი, რომელიც მუშაობს მხოლოდ async ფუნქციებში შიგნით. async/await გვაძლევს საშუალებას დავწეროთ ასინქრონული კოდი ისე, როგორც სინქრონული, რაც ზრდის კოდის წაკითხულობას და გამარტივებას")
// 11)რა განსხვავებაა class-სა და object-ს შორის?
console.log("---------")
console.log("Task 11")
console.log("class არის შაბლონი, რომელიც გამოიყენება ობიექტების შესაქმნელად. ხოლო object არის კონკრეტული მაგალითი class-ის. ანუ class არის მეთოდი როგორც გეგმა, ხოლო object არის როგორც სახლი რომელიც აშენებულია ამ გეგმის მიხედვით. მაგალითად Car არის class და myCar არის object რომელიც შექმნილია Car-ის კლასის მიხედვით, რაც კონსტრუქტორში არის მინიჭებული.")
// 12)რას აკეთებს constructor class-ში?
console.log("---------")
console.log("Task 12")
console.log("constructor არის მეთოდი რომელიც ვიძახებთ ობიექტის შექმნისას რაც ზემოთ ვახსენე Car-კლასზე, ანუ constructor(name,model) და ობიექტში კი ვანიჭერბ new Car('Mercedes','C class')")
//13)რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის
console.log("---------")
console.log("Task 13")
console.log("მემორი ჰიპში ინახება ობიექტები, მასივები, ფუნქციები. ხოლო მემორი სტეკში კი პრიმიტივები, როგორებიცაა: სტრინგი, ნამბერი, ბულეანი, ნალები სიმბოლოები და underfuend.")
//14) რა არის ქოლსტეკი
console.log("---------")
console.log("Task 14")
console.log("ქოლსტეკი არის ფუნქციების გამოძახება, ანუ მაგალითად არის ორი ფუნქცია რომელიც გამოძახებს როგორც გადაცემითი ჯაჭვი უხეშად რომ ვთქვატ  fun1 და fun2  ანუ fun2-ში ვწერ fun1-ს და იძახებს მიმდინარეობით. ")
//15) რა არის ივენთ ლუპი
console.log("---------")
console.log("Task 15")
console.log("ივენტ ლუპი არის ჯავასკრიპტის მექანიმზი, რომელიც აკონტროლებს ქოლსტეკს და უზრუნველყოფს კოდის სწორ დროს შესრულებას")